#### ViewTemplateApplicationOption Enumeration

---

|  |
| --- |
| See Also |

Options for applying view templates

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ViewTemplateApplicationOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ViewTemplateApplicationOption ``` |

| Visual C++ |
| --- |
| ``` public enum class ViewTemplateApplicationOption ``` |

# Members

| Member name | Description |
| --- | --- |
| AllParameters | Apply all parameters controlled by template |
| UncontrolledParameters | Apply only parameters controlled by template and not controlled by currently assigned view template |
| AllParametersAndStickIfNone | Apply all parameters controlled by template and if none is currently assigned make it view template |

# See Also

Autodesk.Revit.DB Namespace